/**
* CoffeeMachine change.
* Надо реализовать метод выдачи сдачи для автомата.
* int[] changes(int value, int price)
* value = купюра. 50 100 и тд.
* price = цена кофе
* в автомате монеты наминалом 1 2 5 10.
* Пример. Мы засунули 50 рублей выбрали кофе за 35. Сдачу автомат должен дать 15 рублей
* Алгоритм должен вернуть наименьшее количество монет.
* Метод вернет массив {10, 5} = 15 рублей
* создать задачу залить в репозитори добавить ссылку
* @author Mikhail Shonorov (shonorov@gmail.com)
* @version $Id$
* @since 0.1
*/
package ru.job4j.coffe;